astb_relise/src/Reports/ОтчетПоОбеспеченности/ОтчетПоОбеспеченности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоОбеспеченности</name>
  <comment>//+++АСТБ_Горюшин_Алексей_40502</comment>
  <attributes>
    <name>НПериод</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Нподразделения</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>НСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураВыдачи</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Report>

astb_relise/src/Reports/ОтчетПоОбеспеченности/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура НподразделенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Отчет.ОтчетПоОбеспеченности.Форма.ФормаВыбораДереваПодразделений",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Данные = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВыбранноеЗначение);
	Отчет.НПодразделения.Очистить();
	Для каждого Элемент Из Данные Цикл	
		Отчет.НПодразделения.Добавить(Элемент);	
	КонецЦикла;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура НПериодПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Отчет.НПериод.ДатаНачала) Или НЕ ЗначениеЗаполнено(Отчет.НПериод.ДатаОкончания) Тогда
		Отчет.НПериод.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Отчет.НПериод.ДатаОкончания = КонецМесяца(Отчет.НПериод.ДатаНачала);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Отчет.НПериод.ДатаНачала) Или НЕ ЗначениеЗаполнено(Отчет.НПериод.ДатаОкончания) Тогда
		Отчет.НПериод.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Отчет.НПериод.ДатаОкончания = КонецМесяца(Отчет.НПериод.ДатаНачала);
	КонецЕсли;
КонецПроцедуры
